app/controllers/songs_controller.rb

  def edit
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
      redirect_to artists_path, alert: "Artist not found"
    elsif params[:artist_id] && !Song.exists?(id: params[:id], artist_id: params[:artist_id])
      redirect_to artist_songs_path(params[:artist_id]), alert: "Song not found"
    else
      @artist_id = params[:artist_id]
      @song = Song.find(params[:id])
---
SELECT "artists".* FROM "artists"
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
SELECT  1 AS one FROM "songs" WHERE "songs"."id" = ? AND "songs"."artist_id" = ? LIMIT 1  [["id", 1234], ["artist_id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]